app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
---
    def index
        @articles = Article.all.reverse

INSERT INTO "articles" ("title", "text", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "first post by user"], ["text", "this is a user post\r\n"], ["created_at", "2019-12-10 12:01:54.304561"], ["updated_at", "2019-12-10 12:01:54.304561"], ["user_id", 2]]
---
    def create
        @article = current_user.articles.build(article_params)
        if @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 2]]
---
    def destroy
        @article = Article.find(params[:id])
        if @article.destroy