app/controllers/comments_controller.rb

    def create
        @article = Article.find(params[:article_id])
        @comment = @article.comments.create(comment_params.merge(user_id: current_user.id))
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "adasda"], ["body", " asdasdas sa d as d as d a s d a sd a sd a s "], ["article_id", 1], ["created_at", "2019-12-10 14:20:06.394952"], ["updated_at", "2019-12-10 14:20:06.394952"]]

    def edit
        @article = Article.find(params[:article_id])
        @comment = @article.comment.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ? AND "comments"."id" = ? LIMIT ?  [["article_id", 1], ["id", 2], ["LIMIT", 1]]